{
  "id": "r-202501311452-1hs0kde",
  "source": "reddit",
  "reddit_id": "1hs0kde",
  "timestamp": "2025-01-31T14:52:45.735024",
  "title": "[Alasdair Gold] Spurs look at Sam Johnstone as Vicario cover ",
  "content": "Don't miss any of the latest and best Spurs news - sign up to the free Tottenham newsletter for updates straight to your inbox We have more newsletters Don't miss any of the latest and best Spurs news - sign up to the free Tottenham newsletter for updates straight to your inbox We have more newsletters  Tottenham have looked at various goalkeepers including Wolves stopper Sam Johnstone as potential cover for their injured stopper Guglielmo Vicario, football.london understands.  Vicario fractured his foot during the 4-0 win at Manchester City in November and 36-year-old Fraser Forster has been filling since with the Italian set to be out for a while longer. The former England international's displays have been mixed since stepping into the breach at Tottenham with some good early performances overshadowed by some mistakes in recent weeks, most notably with the ball at his feet under pressure. Johnstone, 31 and also an England international with four caps, has made seven Premier League appearances this season for Wolves since arriving last summer in a £10million move from Crystal Palace at a time when Jose Sa appeared set for a Saudi Pro League move.  However, that move for the Portuguese stopper did not materialise and the two have shared the game time since, around a Johnstone injury, although now it appears that new Wolves boss Vitor Pereira has decided on Sa as his number one. football.london understands that Johnstone, who Tottenham had previously considered before signing Forster, was one of the candidates that Spurs were looking at to provide cover during Vicario's absence, however it does not appear at this point that any interest in the keeper will be taken further. Listen to the latest episode of Gold & Guest Talk Tottenham by  clicking here  for in-depth Spurs chat on your preferred podcast platform. Want breaking and top Tottenham stories sent straight to you? Join our Spurs WhatsApp community by  clicking this link.  If you're curious you can check out our privacy policy here. ",
  "url": "https://www.football.london/tottenham-hotspur-fc/transfer-news/tottenham-eye-up-wolves-goalkeeper-30698271",
  "tier": 1,
  "metadata": {
    "flair": "Transfer News: Tier 1",
    "saved_at": "2025-01-31T14:52:45.735037"
  }
}