{
  "id": "r-202501311441-1i9xoip",
  "source": "reddit",
  "reddit_id": "1i9xoip",
  "timestamp": "2025-01-31T14:41:07.736328",
  "title": "Richarlison revival, Van de Ven return, belief. How Spurs can save Ange [Tom Allnutt]",
  "content": "On the platform at Frankfurt station on Wednesday, a Tottenham Hotspur fan en route to Hoffenheim had just declared Jürgen Klinsmann to be her preferred successor to Ange Postecoglou when Klinsmann, to the group’s delight, suddenly appeared upstairs, walking across the concourse, presumably also on his way to the game. If only Postecoglou could work his magic so swiftly, to propel Tottenham up the Premier League table, win a cup, or even just heal one or two of his 11 injured players in time to face Leicester City today at the Tottenham Hotspur Stadium. When Spurs drew away to Leicester on the opening day of the season, Postecoglou’s side entertained realistic ambitions of finishing in the top four. At 2pm on Sunday, the aim is to strengthen the buffer between themselves and the bottom three. Postecoglou was back to his bullish best late on Thursday after the 3-2 win over Hoffenheim, insisting his team were “on the right road”, that the players’ “belief” was all that matters and that his long and layered career had taught him the key in a crisis is to block out “the noise” and “not get influenced by the current mood”. After his downbeat and occasionally surly responses in recent weeks, it felt like something of a return to form for Postecoglou, buoyed by victory and up for the fight. Spurs are certainly not out of the woods yet, though, and any optimistic fans heartened by a gutsy win over struggling Hoffenheim in the Europa League should be wary, despite Leicester losing their past seven consecutive Premier League games under Ruud van Nistelrooy. After all of Tottenham’s biggest wins this season — against Everton (3-0), Manchester United (3-0), West Ham (4-1), Aston Villa (4-1), Manchester City (4-0), Southampton (5-0) and even Liverpool in the Carabao Cup (1-0) — they failed to win their next match in the league. At full-time in Germany on Thursday night, three or four players looked dead on their feet. Yet there remains a narrow path for Postecoglou, a way to save this turbulent season and perhaps even his job. He is nearly two years into a four-year contract at Spurs and there is a belief at the club that he can still turn results around, as well as an awareness of the impact of the list of absentees. Interim appointments made things worse after Antonio Conte and José Mourinho while there could also be a middle way, where Postecoglou completes the season but another coach, with similar principles, takes the project on to its second phase. What is clear is that Postecoglou’s tenure will be defined by the next few weeks, when he needs to get big decisions right and several elements to work in his favour.  Only Brighton & Hove Albion’s players have missed more days through injury this season than Tottenham’s and while fatigue has affected all areas of the team, the defence has been hit hardest. Cristian Romero and Micky van de Ven are crucial to the way Spurs play, with their ability to adopt the aggressive, high line and make quick recovery runs, so losing both in November, just after each had returned from injury, has been central to Tottenham’s downfall. The hope is Romero and Van de Ven will resume full training this week, which could put them in contention for Brentford away next weekend and then Liverpool in the second leg of the Carabao Cup four days later. Romero’s leadership would be invaluable at Anfield, as would Van de Ven’s pace against Mohamed Salah, but it will be a delicate decision to make. Postecoglou has to avoid rushing them back before they are ready because Spurs cannot afford to lose them again. With Dominic Solanke out for six weeks, and therefore missing both cup games against Liverpool in the Carabao Cup and Aston Villa in the FA Cup, the return to fitness of Richarlison is timely, although Solanke, who injured his knee in training last weekend, may not have broken down if cover had arrived sooner. Tottenham were open to selling Richarlison last summer but Postecoglou has to find a way to unearth the Brazilian’s best version now, the player they signed for £60million from Everton in 2022 and the one who scored nine goals in ten games during a golden spell under Postecoglou this time last year. Injuries have plagued Richarlison’s three seasons at Spurs and he is a complicated character, with whom coaches have found it difficult to engage. Conte’s hard-line approach — he called Richarlison “selfish” when he complained about a lack of game time — failed to stir a response and Postecoglou has never been one to cosy up to players either. A confident and healthy Richarlison could make all the difference. “When Richy is playing he is Brazil’s No9,” said Postecoglou on Friday. “When he played for us last year he was scoring goals.” Lucas Bergvall and Archie Gray both dropped to the turf and lay flat on their backs at the final whistle on Thursday night, the exhaustion felt by Tottenham’s two 18-year-olds clear for all to see. They have certainly benefited from the injury crisis, having been given more matches and responsibility than they could ever have imagined when they signed from Djurgarden and Leeds United for about £40million combined last summer. At some point, Bergvall and Gray may look back on this period as a formative one — Bergvall has been deployed as a No6 and No8 while Gray has played right, left and centre back, as well as in central midfield — but they need to be managed carefully at a time when errors, a drop in form or injury could have lasting damage. James Maddison was visibly emotional when talking about Bergvall and Gray’s contributions after the game. “I went up to the lads like Lucas and Archie and said, ‘Don’t underestimate what you’re doing right now,’” he said. “We’re asking so much of them at such a young age.” Even before Solanke’s injury, Spurs were prioritising bringing in a forward in the January transfer window but they are yet to sign any outfield players, after the arrival of goalkeeper Antonin Kinsky on January 5. All of Tottenham’s senior attacking players, apart from the returning Richarlison, are now either injured or exhausted, with Son Heung-min and Dejan Kulusevski overloaded and struggling for form in recent weeks while Solanke, Brennan Johnson, Timo Werner and Wilson Odobert are all on the sidelines. The 17-year-old Mikey Moore has become an important option. Tottenham’s league position and salary structure have made it difficult to attract the calibre of player they want, with Paris Saint-Germain’s Randal Kolo Muani making it clear early he preferred Juventus, while the likes of Manchester City and Arsenal entering the forwards market has also knocked Spurs down the pecking order. Postecoglou has admitted that “potentially” there may be no more new signings, although there is a belief the market may open up once the league phase of European competitions ends this week and clubs that have not progressed decide they need to trim their wage bills. Spurs need to be ready to pounce. Tottenham cannot afford to be complacent about their position in the Premier League, with only eight points between them and the bottom three, but realistically they are not going to be relegated. According to Opta’s supercomputer, there is a 0.07 per cent chance that Spurs go down, presumably because the teams 18th to 20th — Ipswich Town, Leicester and Southampton — are also rarely picking up points. With players back, Tottenham should pull up into mid-table. If that happens, Postecoglou might do well to consider using the league to rest and rotate, while directing the team’s main focus and energy into the cups and, specifically, the Europa League. Fighting for the European places in the Premier League has always been the priority for Tottenham in recent years but their lowly position gives them a rare opportunity to concentrate fully on winning a trophy. And why not? Winning the Europa League would fast-track them into the Champions League and it is probably their best chance of silverware this season too, given none of Liverpool, Arsenal or Manchester City stand in their way. There are no Champions League drop-outs either after Uefa abolished that rule, which means that Athletic Bilbao, Lazio, Eintracht Frankfurt and Manchester United are probably the teams to beat. A first trophy since 2008, and first in Europe since 1984, would secure Postecoglou legendary status at Tottenham. Certainly, nobody would remember when they finished in the league. For exclusive chat, discussion and fun from our experts, join the Times Football Channel on Instagram © Times Media Limited 2025. Registered in England No. 894646. Registered office: 1 London Bridge Street, SE1 9GF.",
  "url": "https://www.thetimes.com/sport/football/article/how-spurs-can-save-ange-postecoglou-richarlison-micky-van-de-ven-p82rrndr7",
  "tier": 2,
  "metadata": {
    "flair": "Transfer News: Tier 2",
    "saved_at": "2025-01-31T14:41:07.736345"
  }
}