{
  "id": "r-202501311458-1hvvip6",
  "source": "reddit",
  "reddit_id": "1hvvip6",
  "timestamp": "2025-01-31T14:58:02.538715",
  "title": "Richard Ríos' agent reveals the chances of the midfielder leaving Palmeiras now [Vamo Futebol]",
  "content": " Jogador colombiano é alvo de diversas sondagens de clubes europeus. O Palmeias tem em seu elenco alguns jogadores visto com grande potencial de venda. Richard Ríos é um dos principais ativos do Verdão. Isso porque, o meio-campista já recebeu diversas procuras de times europeus. Manchester United, PSG e outros clubes do velho continente estariam interessado em seu futebol. O nome de Richard Ríos chegou até a ser especulado em uma troca por Andreas Pereira, mas acabou descartada esta possibilidade. Nos últimos dias, Napoli, Wolves e Tottenham apareceram como outros possíveis interessados. O Vamo Futebol então entrou em contato com o empresário de Richard Ríos, que respondeu sobre a situação do meia do Palmeiras. Gabriel Dias, empresário de Richard Ríos, comentou sobre as possibilidades de o meio-campista deixar o Verdão. Ao ser questionado sobre uma proposta do Tottenham que teria sido recusada pelo Palmeiras, o empresário respondeu. “Escutamos alguns rumores sobre o tema que estavam especulando o nome dele desde o ano passado. Mas não chegou nada ainda concreto”, disse Gabriel. Ou seja, até este dia começo de janeiro de 2025, todos os clubes que apareceram como interessados, ainda não fez nenhuma oferta oficial ao Palmeiras pela contratação de Richard Ríos. Outra questão que sempre se especula é quando o Palmeiras estaria disposto a vender Richard Ríos. Isso porque, o Verdão gostaria de manter seus principais jogadores ao menos até a disputa do Mundial de Clubes deste ano. Sobre uma venda neste momento, Gabriel Dias respondeu: “Eu acho difícil agora, mas não impossível”, sendo assim, Ríchard Rios deve permanecer no Alviverde ao menos por enquanto. Para tirá-lo agora, teria que ser uma proposta irrecusável. Pedindo mais de R$ 100 milhões para vender Richard Ríos, o Verdão terá um lucro enorme com a negociação do atleta. Isso porque o Palmeiras gastou R$ 7,5 milhões para comprar 70% dos direitos econômicos do meio-campo. Recentemente, o Palmeiras ainda renovou o contrato de Richard Ríos e estabeleceu uma multa de mais de R$ 600 milhões. Além disso, o meia também recebeu um aumento salarial.",
  "url": "https://www.vamofutebol.com/empresario-de-richard-rios-revela-quais-chances-do-meia-sair-do-palmeiras-agora/",
  "tier": 4,
  "metadata": {
    "flair": "Transfer: News",
    "saved_at": "2025-01-31T14:58:02.538731"
  }
}