{
  "id": "r-202501311450-1i0q8jw",
  "source": "reddit",
  "reddit_id": "1i0q8jw",
  "timestamp": "2025-01-31T14:50:13.528979",
  "title": "[DiMarzio] Napoli have held exploratory talks for Timo Werner. A possible deal could be unlocked after the North London derby; at that point there could be the green light",
  "content": "Il club azzurro è alla ricerca del sostituto ideale di Kvaratskhelia La storia tra Kvaratkshelia e il Napoli è ormai agli sgoccioli, come dimostrato dal fatto che la cessione al PSG sia ai dettagli finali. Manna è ora alla ricerca del sostituto, con i nomi sul tavolo che sono quelli di Garnacho e la novità Werner. Il direttore sportivo azzurro è stato segnalato in serata a Barcellona, dove ha incontrato gli agenti di Garnacho per capire la fattibilità dell’operazione e la volontà del giocatore, oltre che le richieste di ingaggio. Lo United ha chiesto 70 milioni di sterline, considerati troppi dagli azzurri: la sensazione è che o si tratta a un prezzo diverso o il Napoli abbandona la pista. Se non dovesse effettuare l’investimento su un giocatore giovane, il club di De Laurentiis può prendere in prestito un profilo importante. Il nome sondato nelle ultime ore è quello di Timo Werner. Ci sono stati dei contatti esplorativi per il giocatore tedesco, che in questa stagione si trova al Tottenham, in prestito dal Lipsia. Gli inglesi al momento hanno diversi indisponibili in vista della partita contro l’Arsenal in programma venerdì. Per questo motivo, il possibile affare si sbloccherebbe dopo il derby di Londra; a quel punto ci potrebbe essere il via libera.       Continua a leggerePrecedente Milan, mercoledì giornata decisiva per RashfordProssimo Napoli, ai dettagli finali la cessione di Kvaratskhelia al PSG: le cifre  Copryright © 2025 GDM Comunication   @MagellanoNetwork",
  "url": "https://gianlucadimarzio.com/napoli-garnacho-werner-calciomercato-news-13-gennaio-2025/",
  "tier": 2,
  "metadata": {
    "flair": "Transfer News: Tier 2",
    "saved_at": "2025-01-31T14:50:13.528991"
  }
}