{
  "id": "r-202501311458-1i7floh",
  "source": "reddit",
  "reddit_id": "1i7floh",
  "timestamp": "2025-01-31T14:58:25.804557",
  "title": "Milan love RBs made in North London",
  "content": "Manchester City have reached an agreement with AC Milan over a loan deal for Kyle Walker. The 34-year-old has won 17 trophies during his time at City, including six Premier League titles and the Champions League, following his £50 million move from Tottenham in 2017. Walker was appointed as City’s captain at the start of the season but has now opted to leave Pep Guardiola’s side before the campaign is over. According to Sky Sports Italy, Walker will join AC Milan on loan and the Serie A club have the option to buy the England international for €5 million (£4.2m). Walker is understood to have agreed a deal with Milan which will run until 2027 if the move is made permanent, and the defender is due to arrive in Italy on Thursday to finalise his move. Earlier this month, Guardiola revealed that Walker had asked to leave City. ‘Two days ago, Kyle asked to explore the options to play abroad at the end of his career,’ Guardiola said. ‘In his [Walker’s] mind, he would like to explore it, to go to another country, to play the last years [somewhere else] for many reasons. ‘For that reason, I prefer playing other players whose mind is here.’ AC Milan currently sit eighth in Serie A and 19 points behind league leaders Napoli. In the Champions League, AC Milan sit in the play-off places with two games remaining but remain in contention to secure an automatic place in the knockout round. For more stories like this, check our sport page. Follow Metro Sport for the latest news on \nFacebook, Twitter and Instagram. Arrow\nMORE: Man Utd player branded ‘one of the worst to ever wear the shirt’ Arrow\nMORE: How many teams qualify for the Champions League knockouts and how many games are left? Arrow\nMORE: ‘Ruben Amorim is wrong – I have played in a much worse Man Utd team ‘",
  "url": "https://metro.co.uk/2025/01/22/manchester-city-reach-agreement-ac-milan-kyle-walker-transfer-22412950/",
  "tier": 4,
  "metadata": {
    "flair": "Transfer: News",
    "saved_at": "2025-01-31T14:58:25.806605"
  }
}