{
  "id": "r-202501311456-1i5srox",
  "source": "reddit",
  "reddit_id": "1i5srox",
  "timestamp": "2025-01-31T14:56:25.062245",
  "title": "[Dave Hynter] Postecoglou on thin ice at Tottenham but Levy still hoping for turnaround",
  "content": "Daniel Levy intends to give Ange Postecoglou the opportunity to revive Tottenham’s fortunes, with the under-pressure manager to remain in charge for the games this week against Hoffenheim in the Europa League and Leicester in the Premier League, although the situation is precarious. Levy would normally be expected to sack a manager who has presided over a league run of five points from 10 matches, as Postecoglou has done to leave the club languishing in 15th place. The 3-2 defeat at Everton on Sunday was the latest low, with Spurs 3-0 down at half-time against a team that had scored 15 goals in 20 previous league matches this season. Their rally towards the end did not obscure the faultlines. Their form is unacceptable and Levy knows it better than anyone. But Levy the chairman can see that Postecoglou – whose vision has generated buy-in from the fans, even if many are beside themselves with frustration – has been gravely undermined by injuries. Postecoglou has been running with double-digit absentees (or thereabouts) for weeks and was without 10 senior players at Goodison Park, including his first‑choice defence, apart from the right-back Pedro Porro. The hope, fervently held by everyone at the club, is that things will start to improve once the selection crisis eases. No chairman wants to make a managerial change in the middle of the season, especially when there is no obvious replacement available. Postecoglou has been able to guide his team to the semi-finals of the Carabao Cup, in which they hold a 1-0 lead against Liverpool going into the second leg at Anfield on 6 February. Spurs are ninth in the Europa League table, well set to qualify for the knockout phase. If they finish in the top eight they will advance straight to the last 16. Hoffenheim are enduring a terrible season: fourth from bottom of the Bundesliga, 26th in the Europa League. Spurs finish their group campaign at home against Elfsborg on Thursday week. Remarkably, they are still the favourites with many bookmakers to win the competition. The Europa League winners qualify for the Champions League next season. Tottenham’s only league win of the dismal current sequence came at bottom-of-the-table Southampton. Yet Levy knows that when Postecoglou’s team click with all of the main players available, they are capable of thrilling football and results. Two months ago they won 4-0 at Manchester City. The Carabao Cup first-leg win against Liverpool came the Wednesday before last. Sign up to Football Daily Kick off your evenings with the Guardian's take on the world of football after newsletter promotion Spurs have recalled the striker Dane Scarlett, from his loan at Oxford in the Championship, but they are expected to send him out again this month. They were not happy with the 20-year-old’s playing time.",
  "url": "https://www.theguardian.com/football/2025/jan/20/postecoglou-on-thin-ice-at-tottenham-but-levy-still-hoping-for-turnaround",
  "tier": 2,
  "metadata": {
    "flair": "Transfer News: Tier 2",
    "saved_at": "2025-01-31T14:56:25.062266"
  }
}