{
  "id": "r-202501311453-1i61uel",
  "source": "reddit",
  "reddit_id": "1i61uel",
  "timestamp": "2025-01-31T14:53:49.386369",
  "title": "[Gary Jacob] Spurs sticking by Ange Postecoglou despite renewed pressure on head coach",
  "content": "Ange Postecoglou retains the support of the Tottenham Hotspur hierarchy, with the club not looking to change their head coach at this point.  Spurs fell to a 3-2 defeat by Everton at Goodison Park on Sunday — having been 3-0 down after a dismal first half — to extend their poor run to only one win in ten Premier League games. They are 15th in the table, their lowest position after 22 games since 2009, only eight points above the relegation zone and 14 points off the top four.  Postecoglou faces a crucial ten days, with Spurs playing three sides they would usually be expected to beat. Hoffenheim, their Europa League opponents in Germany on Thursday, are fourth-bottom of the Bundesliga, while they round off their league-stage campaign a week on Thursday at home to the Swedish minnows Elfsborg, who have not played a match for five weeks. In between, on Sunday, Tottenham host Leicester City, who have lost their past seven Premier League games. Postecoglou, 59, has come under renewed pressure after his side suffered a 12th defeat of the league season at Goodison Park. The Tottenham hierarchy appreciate that the Australian has been dealing with an injury crisis and want to help him before the January window closes. So far, they have only signed Antonin Kinsky, a goalkeeper, this month but they have been looking for a centre back. The head coach hopes that Micky van de Ven and Cristian Romero, his two first-choice centre backs, will return from their injuries at the end of the month. Dominic Solanke, the striker, is out for a few weeks with a knee injury, but the hope is that he can be fit to face Liverpool in the Carabao Cup semi-final, second leg, on February 6, with Spurs holding a 1-0 lead from the first leg. Brennan Johnson, the winger, will miss between three and four weeks with a calf issue.  Spurs are also still in the FA Cup, with a fourth-round tie away to Aston Villa next month, and lie ninth in the 36-team Europa League table, needing positive results in their final two matches to get into the top eight and secure automatic qualification for the round of 16. Tottenham have recalled Dane Scarlett from Oxford United, but the 20-year-old forward is expected to make a second loan move of the season to get more minutes. © Times Media Limited 2025. Registered in England No. 894646. Registered office: 1 London Bridge Street, SE1 9GF.",
  "url": "https://www.thetimes.com/sport/football/article/ange-postecoglou-spurs-tottenham-news-93mv3k5n7",
  "tier": 2,
  "metadata": {
    "flair": "Transfer News: Tier 2",
    "saved_at": "2025-01-31T14:53:49.386380"
  }
}