{
  "id": "r-202501311459-1i887kg",
  "source": "reddit",
  "reddit_id": "1i887kg",
  "timestamp": "2025-01-31T14:59:26.091616",
  "title": "Transfer Roundup [Jacob Steinberg - The Guardian]",
  "content": "Napoli are pushing to reach an agreement with Manchester United over Alejandro Garnacho but their hopes of signing the winger could be derailed by Chelsea. Garnacho’s agents attended Chelsea’s win over Wolves this week and the Argentinian’s future remains up in the air. Napoli have identified the 20-year-old as a replacement for Khvicha Kvaratskhelia, who has joined Paris Saint-Germain, but are yet to agree a fee. The Italian club have looked at Borussia Dortmund’s Karim Adeyemi as an alternative. The situation is unpredictable. United are understood to be under no pressure to sell but the noise around Garnacho is refusing to go away. He was dropped by Ruben Amorim last month and has not had a regular starting role under the new United head coach. Chelsea have been conducting background checks on Garnacho’s character and are weighing up whether to bid. Enzo Maresca could benefit from adding a right-footed winger to his squad. Chelsea have also made checks on Borussia Dortmund’s Jamie Gittens and Bayern Munich’s Mathys Tel. Bayern are interested in Christopher Nkunku – agreeing personal terms with the France forward would not be an issue – but have not met Chelsea’s asking price. Garnacho played a key role in United winning the FA Cup last season, scoring in the victory over Manchester City in the final. He has struggled for consistency this season but has seven goals. Chelsea are willing to allow fringe players to leave, with Renato Veiga poised to join Juventus on loan until the end of the season. Torino and Lazio have been trying to sign Cesare Casadei. Carney Chukwuemeka and Ben Chiwell are available and Milan have been linked with João Félix. Juventus have signed the France forward Randal Kolo Muani from PSG on loan until the end of the season for €1m (£840,000) plus up to €2.6m. Kolo Muani has been out of favour under Luis Enrique. Chris Wood has signed a two-year contract extension with Nottingham Forest until 2027. The New Zealand forward has scored 14 Premier League goals to help Forest climb to third in the table. Wood, 33, initially joined Forest on loan from Newcastle in January 2023. West Ham are tracking the Sunderland midfielder Dan Neil but face a challenge to seal a deal this month. Sunderland are pushing for automatic promotion from the Championship and are unlikely to want to lose their captain, who also has interest from Everton. The 23-year-old is valued at about £15m. Sunderland are fourth, four points behind second-placed Sheffield United. West Ham do not have extensive funds, with meeting the Premier League’s profitability and sustainability regulations a factor in recruitment decisions, but have shown a willingness to invest in talent for the future. A deal for the 19-year-old OH Leuven midfielder Ezechiel Banzuzi is close and Graham Potter is keen to bolster his squad. West Ham’s new manager wants a centre-back, midfielder and striker. West Ham are a potential destination for Evan Ferguson if Brighton allow the striker to leave on loan. Their strongest competition for him comes from Bournemouth but there is also interest from Fulham, Everton and Tottenham. Alternative targets for West Ham include Fulham’s Rodrigo Muniz, RB Leipzig’s André Silva and Strasbourg’s Emanuel Emegha. Potter is said to have turned down the chance to sign the Chelsea defender Axel Disasi on loan. Ipswich have signed Julio Enciso on loan from Brighton until the end of the season. The 21-year-old Paraguay international, an attacking midfielder, has made 12 Premier League appearances this season. The Aston Villa defender Diego Carlos has joined Fenerbahce in a reported £8.45m deal. The 31-year-old made 58 appearances after joining from Sevilla in 2022 but did not feature in their past five match-day squads as plans for a move began to take shape. Fenerbahce have allowed the Brazilian playmaker Lincoln to join Hull on loan until the end of the season. Sheffield United have signed the striker Tom Cannon from Leicester for £10m. He scored 11 goals in 25 appearances on loan at Stoke in the first half of this season.",
  "url": "https://www.theguardian.com/football/2025/jan/23/transfer-latest-west-ham-face-battle-to-bring-in-dan-neil-from-sunderland",
  "tier": 2,
  "metadata": {
    "flair": "Transfer News: Tier 2",
    "saved_at": "2025-01-31T14:59:26.091629"
  }
}