{
  "id": "r-202501311453-1i11dl0",
  "source": "reddit",
  "reddit_id": "1i11dl0",
  "timestamp": "2025-01-31T14:53:24.027392",
  "title": "Juventus lack funds for Randal Kolo Muani. Juve are not the only club who interest the foward.\n\n#thfc are active, talks between Daniel Levy and Nasser Al-Khelaifi have taken place.\n\nThe Premier League appeals to him (L'Equipe)",
  "content": "Rarement un international français de cette dimension ne s'était retrouvé dans cette situation. Cela fait plus d'un mois que Randal Kolo Muani (26 ans) n'a plus foulé les pelouses. La rupture a été actée de chaque côté depuis des semaines. L'international français, convoqué à Doha pour le Trophée des champions, ne se fait plus aucune illusion. Et ce bien avant, d'avoir été placé hors groupe. Désormais, l'enjeu pour l'ancien buteur de Francfort, acheté 90 M€, sera de se décider. Un élément est clair : son profil plaît. Un premier tri, sur une petite dizaine de clubs, a été effectué ces derniers jours. L'AS Rome, par exemple, a tenté sa chance. Sans retenir l'attention du joueur. Les journaux italiens relayaient ces derniers jours l'intérêt très concret de la Juventus Turin. Dans les faits, cela s'est traduit par des échanges directs entre les directions sportives des deux clubs. Dans ce dossier, le club piémontais ne dispose pas d'une surface financière extensible. Pour financer en totalité le salaire de Kolo Muani (quelque 750 000 euros bruts mensuels) notamment. Mais pas seulement, un prêt avec une option d'achat obligatoire est ainsi à écarter pour la Juventus. A priori, aucune offre écrite n'a été formulée jusqu'à présent. Le joueur s'est montré sensible à l'opportunité de rejoindre l'équipe de Thiago Motta. Mais la Juve n'est pas aujourd'hui le seul projet sur lequel Kolo Muani est ouvert. Le vice-champion du monde dispose de solides pistes par ailleurs. Comme indiqué dans nos colonnes lundi, Tottenham se montre actif. Daniel Levy, le président des Spurs, entretient de très bonnes relations avec Nasser al-Khelaïfi. Des échanges ont eu lieu entre les deux parties. La perspective de rejoindre la Premier League le séduit. D'autres clubs restent attentifs : Manchester United doit gérer le cas Marcus Rashford avant de se lancer. Dortmund, en passe de vendre son attaquant néerlandais Donyell Malen à Aston Villa, reste attentif. Dans tous les cas, le dossier ne devrait pas se finaliser dans les tout prochains jours. \n                    L'incroyable imbroglio Kolo Muani\n                 \n                    Diallo produit des SMS de la mère de Mbappé aux Prud'hommes et réclame 350 000 euros\n                 \n                    Le PSG s'est lancé sur Lucas Chevalier\n                 \n                    OM-Algérie, enfin les retrouvailles\n                ",
  "url": "https://www.lequipe.fr/Football/Actualites/Mercato-la-juve-pousse-pour-kolo-muani-mais-manque-de-fonds/1532044",
  "tier": 4,
  "metadata": {
    "flair": "Transfer: News",
    "saved_at": "2025-01-31T14:53:24.027410"
  }
}